# MemberForces Class

---
An object that represents a member forces on analytical element.
SystemObject Autodesk.Revit.DB.StructureMemberForces
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class MemberForces : IDisposable

    Public Class MemberForces
    	Implements IDisposable

    public ref class MemberForces : IDisposable

    type MemberForces =
        class
            interface IDisposable
        end
The MemberForces type exposes the following members.
| Name| Description
---|---|---
| MemberForces|  Creates a new instance of MemberForces.
Top
| Name| Description
---|---|---
| Force|  The translational forces at relative point position of the element.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Moment|  The rotational forces at relative point position of the element.
| Start|  Member Forces position on analytical element. True for start, false for end.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the MemberForces
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Structure Namespace